<a href="https://colab.research.google.com/github/Camolas/Psychosis-AI/blob/master/TestesDataAnalysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# importing libraries
import pandas as pd
import numpy as np
  
nums = {'Set_of_Numbers': [2, 3, 5, 7, 11, 13, 
                           np.nan, 19, 23, np.nan]}
  
# Create the dataframe
df = pd.DataFrame(nums, columns =['Set_of_Numbers'])

df

   Set_of_Numbers
0             2.0
1             3.0
2             5.0
3             7.0
4            11.0
5            13.0
6             NaN
7            19.0
8            23.0
9             NaN

In [ ]:

# Apply the function
df['Set_of_Numbers'] = df['Set_of_Numbers'].fillna(0)
  
# print the DataFrame
df

   Set_of_Numbers
0             2.0
1             3.0
2             5.0
3             7.0
4            11.0
5            13.0
6             0.0
7            19.0
8            23.0
9             0.0

In [ ]:
# importing libraries
import pandas as pd
import numpy as np
  
nums = {'Number_set_1': [0, 1, 1, 2, 3, 5, np.nan,
                         13, 21, np.nan],
       'Number_set_2': [3, 7, np.nan, 23, 31, 41, 
                        np.nan, 59, 67, np.nan],
       'Number_set_3': [2, 3, 5, np.nan, 11, 13, 17,
                        19, 23, np.nan]}
nums

{'Number_set_1': [0, 1, 1, 2, 3, 5, nan, 13, 21, nan],
 'Number_set_2': [3, 7, nan, 23, 31, 41, nan, 59, 67, nan],
 'Number_set_3': [2, 3, 5, nan, 11, 13, 17, 19, 23, nan]}

In [ ]:
# Create the dataframe
df2 = pd.DataFrame(nums)

df2

   Number_set_1  Number_set_2  Number_set_3
0           0.0           3.0           2.0
1           1.0           7.0           3.0
2           1.0           NaN           5.0
3           2.0          23.0           NaN
4           3.0          31.0          11.0
5           5.0          41.0          13.0
6           NaN           NaN          17.0
7          13.0          59.0          19.0
8          21.0          67.0          23.0
9           NaN           NaN           NaN

In [ ]:
# Apply the function
df2 = df2.fillna(0)
  
# print the DataFrame
df2

   Number_set_1  Number_set_2  Number_set_3
0           0.0           3.0           2.0
1           1.0           7.0           3.0
2           1.0           0.0           5.0
3           2.0          23.0           0.0
4           3.0          31.0          11.0
5           5.0          41.0          13.0
6           0.0           0.0          17.0
7          13.0          59.0          19.0
8          21.0          67.0          23.0
9           0.0           0.0           0.0

In [ ]:
df3 = df2.fillna(nr)
df3

NameError: ignored